In [1]:
import pandas as pd

In [2]:
data=pd.read_csv('Practical2.csv')
print(data)

        Name  Maths  Chemistry  Physics  Geography
0       John     45       60.0      NaN       70.0
1       Mary     80       75.0     65.0       90.0
2       Jack     85       80.0     90.0        NaN
3       Jill     70        NaN     80.0       75.0
4       John     45       60.0      NaN       70.0
5       Mary     80       75.0     65.0       90.0
6       Jack     85       80.0     90.0        NaN
7       Jill     70        NaN     80.0       75.0
8      Sarah     50       55.0      NaN       80.0
9        Sam     60       70.0     75.0       85.0
10     David     75       80.0     85.0        NaN
11  Samantha     90        NaN     70.0       75.0
12     Sarah     50       55.0      NaN       80.0
13       Sam     60       70.0     75.0       85.0
14     David     75       80.0     85.0        NaN
15  Samantha     90        NaN     70.0       75.0
16      Alex     55       65.0     75.0       80.0
17     Katie     70       75.0     80.0       85.0
18      Alex     55       65.0     75.0       80.0
19     Katie     70       75.0     80.0       85.0

#Drop Column

In [3]:
data=data.drop('Maths',axis=1)
print(data)

        Name  Chemistry  Physics  Geography
0       John       60.0      NaN       70.0
1       Mary       75.0     65.0       90.0
2       Jack       80.0     90.0        NaN
3       Jill        NaN     80.0       75.0
4       John       60.0      NaN       70.0
5       Mary       75.0     65.0       90.0
6       Jack       80.0     90.0        NaN
7       Jill        NaN     80.0       75.0
8      Sarah       55.0      NaN       80.0
9        Sam       70.0     75.0       85.0
10     David       80.0     85.0        NaN
11  Samantha        NaN     70.0       75.0
12     Sarah       55.0      NaN       80.0
13       Sam       70.0     75.0       85.0
14     David       80.0     85.0        NaN
15  Samantha        NaN     70.0       75.0
16      Alex       65.0     75.0       80.0
17     Katie       75.0     80.0       85.0
18      Alex       65.0     75.0       80.0
19     Katie       75.0     80.0       85.0

#Rename Column

In [11]:
data=data.rename(columns={'Geography':'Computer Science'})

In [12]:
print(data)

        Name  Maths  Chemistry  Physics  Computer Science
0       John     45       60.0     77.5              70.0
1       Mary     80       75.0     65.0              90.0
2       Jack     85       80.0     90.0              80.0
3       Jill     70       70.0     80.0              75.0
4       John     45       60.0     77.5              70.0
5       Mary     80       75.0     65.0              90.0
6       Jack     85       80.0     90.0              80.0
7       Jill     70       70.0     80.0              75.0
8      Sarah     50       55.0     77.5              80.0
9        Sam     60       70.0     75.0              85.0
10     David     75       80.0     85.0              80.0
11  Samantha     90       70.0     70.0              75.0
12     Sarah     50       55.0     77.5              80.0
13       Sam     60       70.0     75.0              85.0
14     David     75       80.0     85.0              80.0
15  Samantha     90       70.0     70.0              75.0
16      Alex     55       65.0     75.0              80.0
17     Katie     70       75.0     80.0              85.0
18      Alex     55       65.0     75.0              80.0
19     Katie     70       75.0     80.0              85.0

#Drop Duplicate Rows

In [6]:
data=data.drop_duplicates()
print(data)

        Name  Chemistry  Physics  Computer Science
0       John       60.0      NaN              70.0
1       Mary       75.0     65.0              90.0
2       Jack       80.0     90.0               NaN
3       Jill        NaN     80.0              75.0
8      Sarah       55.0      NaN              80.0
9        Sam       70.0     75.0              85.0
10     David       80.0     85.0               NaN
11  Samantha        NaN     70.0              75.0
16      Alex       65.0     75.0              80.0
17     Katie       75.0     80.0              85.0

#Drop Null Values

In [7]:
#by default it will drop rows with null value
data=data.dropna()
print(data)

     Name  Chemistry  Physics  Computer Science
1    Mary       75.0     65.0              90.0
9     Sam       70.0     75.0              85.0
16   Alex       65.0     75.0              80.0
17  Katie       75.0     80.0              85.0

#replace Values

In [8]:
data=data.replace(65,60)
print(data)

     Name  Chemistry  Physics  Computer Science
1    Mary       75.0     60.0              90.0
9     Sam       70.0     75.0              85.0
16   Alex       60.0     75.0              80.0
17  Katie       75.0     80.0              85.0

#Replace Values with mean

In [9]:
data=pd.read_csv('Practical2.csv')
print(data)

        Name  Maths  Chemistry  Physics  Geography
0       John     45       60.0      NaN       70.0
1       Mary     80       75.0     65.0       90.0
2       Jack     85       80.0     90.0        NaN
3       Jill     70        NaN     80.0       75.0
4       John     45       60.0      NaN       70.0
5       Mary     80       75.0     65.0       90.0
6       Jack     85       80.0     90.0        NaN
7       Jill     70        NaN     80.0       75.0
8      Sarah     50       55.0      NaN       80.0
9        Sam     60       70.0     75.0       85.0
10     David     75       80.0     85.0        NaN
11  Samantha     90        NaN     70.0       75.0
12     Sarah     50       55.0      NaN       80.0
13       Sam     60       70.0     75.0       85.0
14     David     75       80.0     85.0        NaN
15  Samantha     90        NaN     70.0       75.0
16      Alex     55       65.0     75.0       80.0
17     Katie     70       75.0     80.0       85.0
18      Alex     55       65.0     75.0       80.0
19     Katie     70       75.0     80.0       85.0

In [10]:
chem_mean=data['Chemistry'].mean()
phy_mean=data['Physics'].mean()
geo_mean=data['Geography'].mean()
data['Chemistry']=data['Chemistry'].fillna(chem_mean)
data['Physics']=data['Physics'].fillna(phy_mean)
data['Geography']=data['Geography'].fillna(geo_mean)
print(data)

        Name  Maths  Chemistry  Physics  Geography
0       John     45       60.0     77.5       70.0
1       Mary     80       75.0     65.0       90.0
2       Jack     85       80.0     90.0       80.0
3       Jill     70       70.0     80.0       75.0
4       John     45       60.0     77.5       70.0
5       Mary     80       75.0     65.0       90.0
6       Jack     85       80.0     90.0       80.0
7       Jill     70       70.0     80.0       75.0
8      Sarah     50       55.0     77.5       80.0
9        Sam     60       70.0     75.0       85.0
10     David     75       80.0     85.0       80.0
11  Samantha     90       70.0     70.0       75.0
12     Sarah     50       55.0     77.5       80.0
13       Sam     60       70.0     75.0       85.0
14     David     75       80.0     85.0       80.0
15  Samantha     90       70.0     70.0       75.0
16      Alex     55       65.0     75.0       80.0
17     Katie     70       75.0     80.0       85.0
18      Alex     55       65.0     75.0       80.0
19     Katie     70       75.0     80.0       85.0